const r=[{CatalogueName:"Bow-Bag Kletka",ProductName:"Bow-Bag Kletka",description:`Мягкая синтепоновая сумка подходит для любого сезона. Длину ручки можно легко регулировать, завяжите бант или узел на свой вкус. Сумка закрывается на молнию.
Мы используем только качественную фурнитуру.

Размеры: 
Ширина 44 
Высота 28
Длина одной ручки 88см 

Материал: курточная ткань, синтепон.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"280",priceRUB:"7700",image:"bow-bag_kletka_main.jpg",category:"bags",gallery:["bow-bag_kletka_2.jpg","bow-bag_kletka_3.jpg","bow-bag_kletka_4.jpg"]},{CatalogueName:"Bow-Bag Black",ProductName:"Bow-Bag Black",description:`Мягкая синтепоновая сумка подходит для любого сезона. Длину ручки можно легко регулировать, завяжите бант или узел на свой вкус. Сумка закрывается на молнию.
Мы используем только качественную фурнитуру.

Размеры: 
Ширина 44 
Высота 28
Длина одной ручки 88см 

Материал: курточная ткань, синтепон.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"220",priceRUB:"6400",image:"bow-bag_black_main.jpg",category:"bags",gallery:["bow-bag_black_2.jpg"]},{CatalogueName:"Bow-Bag Pink",ProductName:"Bow-Bag Pink",description:`Мягкая синтепоновая сумка подходит для любого сезона. Длину ручки можно легко регулировать, завяжите бант или узел на свой вкус. Сумка закрывается на молнию.
Мы используем только качественную фурнитуру.

Размеры: 
Ширина 44 
Высота 28
Длина одной ручки 88см 

Материал: курточная ткань, синтепон.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"220",priceRUB:"6400",image:"bow-bag_pink_main.jpg",category:"bags",gallery:["bow-bag_pink_2.jpg","bow-bag_pink_3.jpg"]},{CatalogueName:"Bow-Bag Leo",ProductName:"Bow-Bag Leo",description:`Мягкая синтепоновая сумка подходит для любого сезона. Длину ручки можно легко регулировать, завяжите бант или узел на свой вкус. Сумка закрывается на молнию.
Мы используем только качественную фурнитуру.

Размеры: 
Ширина 44 
Высота 28
Длина одной ручки 88см 

Материал: курточная ткань, синтепон.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"220",priceRUB:"6400",image:"bow-bag_leo_main.jpg",category:"bags",gallery:["bow-bag_leo_2.jpg","bow-bag_leo_3.jpg","bow-bag_leo_4.jpg"]},{CatalogueName:"Crossbody Leo",ProductName:"Crossbody Leo",description:`Невероятно вместительная, но при этом компактная! Уникальная сборка на резинке позволяет сумке *автоматически подстраиваться под содержимое*

-Загрузили много? Сумка аккуратно расширяется, сохраняя форму.

-Носите минимум? Остается изящной и не занимает места. Длина ручки регулируется. Три варианта носки: носите на поясе, через плечо или с короткой ручкой на плече. Внутри сумочки есть вместительный карман на замке.

Материал: плотный атлас, пряжка алюминий.

Размер: длина 45, высота 16, ширина 23
*могут быть погрешности, так как сумка не имеет четкой формы.

Color: Black, Leo, Milk, Brown

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"280",priceRUB:"8200",image:"crossbody_leo_main.jpg",category:"bags",gallery:["crossbody_leo_2.jpg","crossbody_leo_3.jpeg","crossbody_leo_4.jpeg","crossbody_leo_5.jpeg","crossbody_leo_6.jpeg","crossbody_leo_7.jpg","crossbody_leo_8.jpg"]},{CatalogueName:"Косметичка «small»",ProductName:"Косметичка Polka dot «small»",description:`Маленькая, да удаленькая!

Защитит вашу косметику от царапин и разбитых теней, благодаря мягкому синтепону.
Идеальна для путешествий, работы и повседневности.

«подушка безопасности» для вашей косметики
-вместительная
-качественная фурнитура
-элегантный дизайн

Материал: хлопок, синтепон

Размер: длина 23, высота 15, ширина 8

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"80",priceRUB:"2600",image:"polka_dot_cosmetics_small_main.jpeg",category:"cosmetic bags",gallery:["polka_dot_cosmetics_small_3.jpeg","polka_dot_cosmetics_small_4.jpeg"]},{CatalogueName:"Fluffy Hug Candy Pink",ProductName:"Fluffy Hug Candy Pink",description:`Дутая сумка со съемными ленточками. Внутри сумки есть удобный карман на замке.

цвета: forest green, leo, candy pink, black

материал: плащевая ткань с водоотталкивающей пропиткой, синтепон.

размер: длина 50, высота 38, ширина 15, длина ручки на выбор 84, 90 см.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"250",priceRUB:"7200",image:"fluffy-hug-candy-pink_main.jpg",category:"bags",gallery:["fluffy-hug-candy-pink_2.jpg","fluffy-hug-candy-pink_3.jpg"]},{CatalogueName:"Striped Shopper",ProductName:"Striped Shopper",description:`Этот невесомый шоппер станет вашим любимым аксессуаром. Его легко взять с собой в поездки, он без труда помещается в маленькую сумочку или даже карман куртки.

Материал: хлопок 80%, ПЭ 20%, пряжка алюминий.

Размер: ширина 48, высота 39, длина ручки 79

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"190",priceRUB:"5600",image:"striped_shopper_main.jpeg",category:"bags",gallery:["striped_shopper_1.jpeg"]},{CatalogueName:"Carnival Stripes",ProductName:"Carnival Stripes",description:`Маленькая, но с характером: сумка, которая умеет быть элегантной и озорной одновременно, она сделает ваш лаконичный образ игривее и интересней

Материал: плотный атлас, хлопок

Размер: длина 35, высота 21, ширина 10, длина ручки на выбор 90, 105

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"160",priceRUB:"4800",image:"Carnival-main.webp",category:"bags",gallery:["carnival_1.jpeg","carnival_2.jpeg"]},{CatalogueName:"Crossbody Black",ProductName:"Crossbody Black",description:`Невероятно вместительная, но при этом компактная! Уникальная сборка на резинке позволяет сумке *автоматически подстраиваться под содержимое*

-Загрузили много? Сумка аккуратно расширяется, сохраняя форму.

-Носите минимум? Остается изящной и не занимает места. Длина ручки регулируется. Три варианта носки: носите на поясе, через плечо или с короткой ручкой на плече. Внутри сумочки есть вместительный карман на замке.

Материал: плотный атлас, пряжка алюминий.

Размер: длина 45, высота 16, ширина 23
*могут быть погрешности, так как сумка не имеет четкой формы.

Color: Black, Leo, Milk, Brown

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"280",priceRUB:"8200",image:"crossbody-black_main.jpeg",category:"bags",gallery:["crossbody-black_2.jpeg","crossbody-black_1.jpg","crossbody-black_4.jpg","crossbody-black_5.jpg"]},{CatalogueName:"Crossbody Brown",ProductName:"Crossbody Brown",description:`Невероятно вместительная, но при этом компактная! Уникальная сборка на резинке позволяет сумке *автоматически подстраиваться под содержимое*

-Загрузили много? Сумка аккуратно расширяется, сохраняя форму.

-Носите минимум? Остается изящной и не занимает места. Длина ручки регулируется. Три варианта носки: носите на поясе, через плечо или с короткой ручкой на плече. Внутри сумочки есть вместительный карман на замке.

Материал: плотный атлас, пряжка алюминий.

Размер: длина 45, высота 16, ширина 23
*могут быть погрешности, так как сумка не имеет четкой формы.

Color: Black, Leo, Milk, Brown

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"280",priceRUB:"8200",image:"crossbody_brown_3.jpg",category:"bags",gallery:["crossbody_brown_2.jpg","crossbody_brown_main.jpg"]},{CatalogueName:"Косметичка «big»",ProductName:"Косметичка Polka dot «big»",description:`Идеальная спутница для тех, кто ценит порядок и заботится о каждой детали!

-мягкая защита вашей косметики
-вместительная
-качественная фурнитура
-лаконичный дизайн

Материал: хлопок, синтепон.

Размер: длина 31, высота 21, ширина 12

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"135",priceRUB:"4100",image:"polka_dot_cosmectics_big_main.jpeg",category:"cosmetic bags",gallery:["polka_dot_cosmectics_big_2.jpeg"]},{CatalogueName:"Shopper Polka dot",ProductName:"Shopper Polka dot",description:`Мягкий шоппер на завязках. В самом трендовом принте.
Вместительный карман внутри.

Материал: вискоза, хлопок, синтепон

Размер: длина 50, высота 41, ширина 12, длина ручек 71см

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"160",priceRUB:"5000",image:"polka_dot_bag_main.jpeg",category:"bags",gallery:["polka_dot_bag_1.jpeg"]},{CatalogueName:"Shopper Village",ProductName:"Shopper Village",description:`Мягкая, стеганая сумка шоппер на замке.
Внутри есть вместительный карман для самых ценных вещей.
Доступна под заказ! Варианты цветов в каталоге.

Материал: хлопок, синтепон

Размер: длина 48, высота 31, ширина 12, длина ручки 86см

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"250",priceRUB:"8000",image:"shopper_village_main.jpeg",category:"bags",gallery:["shopper_village_2.jpeg","shopper_village_1.jpeg"]},{CatalogueName:"Crossbody Milk",ProductName:"Crossbody Milk",description:`Невероятно вместительная, но при этом компактная! Уникальная сборка на резинке позволяет сумке *автоматически подстраиваться под содержимое*

-Загрузили много? Сумка аккуратно расширяется, сохраняя форму.

-Носите минимум? Остается изящной и не занимает места. Длина ручки регулируется. Три варианта носки: носите на поясе, через плечо или с короткой ручкой на плече. Внутри сумочки есть вместительный карман на замке.

Материал: плотный атлас, пряжка алюминий.

Размер: длина 45, высота 16, ширина 23
*могут быть погрешности, так как сумка не имеет четкой формы.

Color: Black, Leo, Milk, Brown

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"280",priceRUB:"8200",image:"crossbody-milk_main.jpg",category:"bags",gallery:["crossbody-milk_1.jpg","crossbody-milk_3.jpg"]},{CatalogueName:"Косметичка «small»",ProductName:"Косметичка Striped «small»",description:`Маленькая, да удаленькая!

Защитит вашу косметику от царапин и разбитых теней, благодаря мягкому синтепону.
Идеальна для путешествий, работы и повседневности.

«подушка безопасности» для вашей косметики
-вместительная
-качественная фурнитура
-элегантный дизайн

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"80",priceRUB:"2600",image:"striped_cosmectics_small_main.jpeg",category:"cosmetic bags",gallery:["striped_cosmectics_small_2.jpeg","striped_cosmectics_small_3.jpeg"]},{CatalogueName:"Fluffy Hug Black",ProductName:"Fluffy Hug Black",description:`Дутая сумка со съемными ленточками. Внутри сумки есть удобный карман на замке.

цвета: forest green, leo, candy pink, black

материал: плащевая ткань с водоотталкивающей пропиткой, синтепон.

размер: длина 50, высота 38, ширина 15, длина ручки на выбор 84, 90 см.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"250",priceRUB:"7200",image:"fluffy-hug-black_main.jpeg",category:"bags",gallery:["fluffy-hug-black_1.jpeg","fluffy-hug-black_3.jpeg"]},{CatalogueName:"Fluffy Hug Forest Green",ProductName:"Fluffy Hug Forest Green",description:`Дутая сумка со съемными ленточками. Внутри сумки есть удобный карман на замке.

цвета: forest green, leo, candy pink, black

материал: плащевая ткань с водоотталкивающей пропиткой, синтепон.

размеры: длина 50, высота 38, ширина 15, длина ручки на выбор 84, 90 см.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"250",priceRUB:"7200",image:"fluffy-forest-green_main.jpg",category:"bags",gallery:["fluffy-forest-green_1.jpg","fluffy-forest-green_2.jpg","fluffy-forest-green_4.jpg","fluffy-forest-green_5.jpg"]},{CatalogueName:"Fluffy Hug Leo",ProductName:"Fluffy Hug Leo",description:`Дутая сумка со съемными ленточками. Внутри сумки есть удобный карман на замке.

цвета: forest green, leo, candy pink, black

материал: плащевая ткань с водоотталкивающей пропиткой, синтепон.

размер: длина 50, высота 38, ширина 15, длина ручки на выбор 84, 90 см.

Бесплатная доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"250",priceRUB:"7200",image:"fluffy-hug-leo_main.jpg",category:"bags",gallery:["fluffy-hug-leo_2.jpg","fluffy-hug-leo_3.jpg","fluffy-hug-leo_4.jpg","fluffy-hug-leo_5.jpeg"]},{CatalogueName:"Комплект Nuá Black Satin",ProductName:"Комплект Nuá Black Satin",description:`Nuá  — роскошный комплект из шелковистого атласа. Та самая классика, которая всегда будет актуальна. Бра с эффектом пуш-ап, без использования поролоновых подушечек.

Трусики формы галочка обеспечат комфорт и красиво подчеркнут форму ягодиц.

Состав: 80% полиэстер, 20% эластин 
Ластовица трусиков 100% хлопок

Размеры от 70 АА до 85 D

После оформления заказа мы поможем вам подобрать размер. 


Доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"170",priceRUB:"4600",image:"nua-black-satin_main.jpg",category:"нижнее белье",gallery:["nua-black-satin_2.jpg","nua-black-satin_3.jpg","nua-black-satin_4.jpg","nua-black-satin_5.jpg","nua-black-satin_6.jpg","nua-black-satin_7.jpg","nua-black-satin_8.jpg","nua-black-satin_9.jpg","nua-black-satin_10.jpg"]},{CatalogueName:"Комплект Nuá Milk Satin",ProductName:"Комплект Nuá Milk Satin",description:`Nuá  — роскошный комплект из шелковистого атласа. Та самая классика, которая всегда будет актуальна. Бра с эффектом пуш-ап, без использования поролоновых подушечек.

Трусики формы галочка обеспечат комфорт и красиво подчеркнут форму ягодиц.

Состав: 80% полиэстер, 20% эластин 
Ластовица трусиков 100% хлопок

Размеры от 70 АА до 85 D

После оформления заказа мы поможем вам подобрать размер.


Доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"170",priceRUB:"4600",image:"nua-milk-satin_3.jpg",category:"нижнее белье",gallery:["nua-milk-satin_2.jpg","nua-milk-satin_main.jpg","nua-milk-satin_4.jpg","nua-milk-satin_5.jpg","nua-milk-satin_6.jpg","nua-milk-satin_7.jpg","nua-milk-satin_8.jpg","nua-milk-satin_9.jpg"]},{CatalogueName:"Трусики Nuá Black Satin",ProductName:"Трусики Nuá Black Satin",description:`Трусики формы галочка обеспечат комфорт и красиво подчеркнут форму ягодиц.

Состав: 80% полиэстер, 20% эластин 
Ластовица трусиков 100% хлопок


После оформления заказа мы поможем вам подобрать размер.


Доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"60",priceRUB:"1600",image:"trusiki-black-satin_2.jpg",category:"нижнее белье",gallery:["trusiki-black-satin_main.jpg","trusiki-black-satin_3.jpg","trusiki-black-satin_4.jpg"]},{CatalogueName:"Трусики Nuá Milk Satin",ProductName:"Трусики Nuá Milk Satin",description:`Трусики формы галочка обеспечат комфорт и красиво подчеркнут форму ягодиц.

Состав: 80% полиэстер, 20% эластин 
Ластовица трусиков 100% хлопок


После оформления заказа мы поможем вам подобрать размер.


Доставка по Беларуси до пунктов Белпочта, Европочта.

Стоимость доставки в РФ от 450 до 600 рублей. Точная стоимость зависит от адреса получателя.

Также есть международная доставка в большинство стран. Стоимость рассчитывается индивидуально`,priceBYN:"60",priceRUB:"1600",image:"trusiki-milk-satin_main.jpg",category:"нижнее белье",gallery:["trusiki-milk-satin_2.jpg","trusiki-milk-satin_3.jpg"]}];function g(a="/images/"){return r.map((n,e)=>({...n,id:e+1,image:`${a}${n.image}`,gallery:n.gallery.map(i=>`${a}${i}`)}))}function l(){return g("/images/")}const o=l(),c=()=>Promise.resolve(o.filter(a=>a.category!=="нижнее белье")),t=()=>Promise.resolve(o),s=a=>Promise.resolve(o.find(n=>n.id===a)),p=a=>Promise.resolve(o.filter(n=>n.category===a)),_=a=>{const n=a.toLowerCase();return Promise.resolve(o.filter(e=>e.category!=="нижнее белье"&&(e.ProductName.toLowerCase().includes(n)||e.CatalogueName.toLowerCase().includes(n)||e.description.toLowerCase().includes(n))))};export{p as a,c as b,t as c,s as g,_ as s};
